load_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.5" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" enabled="true">
      <stringProp name="TestPlan.comments">Basic performance test for Java application</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <hashTree>
        <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" enabled="true">
          <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
          <stringProp name="ThreadGroup.num_threads">10</stringProp> <!-- Number of threads -->
          <stringProp name="ThreadGroup.ramp_time">10</stringProp> <!-- Ramp-up time -->
          <stringProp name="ThreadGroup.duration">60</stringProp> <!-- Duration -->
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpSamplerGui" testclass="HTTPSamplerProxy" enabled="true">
              <stringProp name="HTTPSampler.domain">your-application-domain.com</stringProp> <!-- Replace with your domain -->
              <stringProp name="HTTPSampler.port">80</stringProp> <!-- Replace with your port -->
              <stringProp name="HTTPSampler.protocol">http</stringProp> <!-- Use 'https' if needed -->
              <stringProp name="HTTPSampler.path">/</stringProp> <!-- Endpoint to test -->
              <stringProp name="HTTPSampler.method">GET</stringProp> <!-- HTTP Method -->
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
              <hashTree/>
            </HTTPSamplerProxy>
          </hashTree>
        </ThreadGroup>
      </hashTree>
    </TestPlan>
  </hashTree>
</jmeterTestPlan>