load_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.4.1" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" enabled="true">
      <stringProp name="TestPlan.comments">Basic performance test for Java application</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <hashTree>
        <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" enabled="true">
          <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
          <stringProp name="ThreadGroup.num_threads">10</stringProp> <!-- Number of concurrent users -->
          <stringProp name="ThreadGroup.ramp_time">10</stringProp> <!-- Time to ramp up to full load -->
          <stringProp name="ThreadGroup.duration">60</stringProp> <!-- Test duration in seconds -->
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpSamplerGui" testclass="HTTPSamplerProxy" enabled="true">
              <stringProp name="HTTPSampler.domain">your-application-domain.com</stringProp> <!-- Replace with your application domain -->
              <stringProp name="HTTPSampler.port">80</stringProp> <!-- Replace with your application port, if different -->
              <stringProp name="HTTPSampler.protocol">http</stringProp> <!-- Use 'https' if your application is using SSL -->
              <stringProp name="HTTPSampler.path">/</stringProp> <!-- Replace with the endpoint you want to test -->
              <stringProp name="HTTPSampler.method">GET</stringProp> <!-- HTTP method -->
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
              <hashTree/>
            </HTTPSamplerProxy>
          </hashTree>
        </ThreadGroup>
      </hashTree>
    </TestPlan>
  </hashTree>
</jmeterTestPlan>